# frozen_string_literal: true

# Source: https://gist.github.com/thb/1042536/a013dd611d15426def518d0d2b3a8abc1af3c0c1
class String
  UNACCENT_HASH = {
    'A'  => 'ÀÁÂÃÄÅĀĂǍẠẢẤẦẨẪẬẮẰẲẴẶǺĄ',
    'a'  => 'àáâãäåāăǎạảấầẩẫậắằẳẵặǻą',
    'C'  => 'ÇĆĈĊČ',
    'c'  => 'çćĉċč',
    'D'  => 'ÐĎĐ',
    'd'  => 'ďđ',
    'E'  => 'ÈÉÊËĒĔĖĘĚẸẺẼẾỀỂỄỆ',
    'e'  => 'èéêëēĕėęěẹẻẽếềểễệ',
    'G'  => 'ĜĞĠĢ',
    'g'  => 'ĝğġģ',
    'H'  => 'ĤĦ',
    'h'  => 'ĥħ',
    'I'  => 'ÌÍÎÏĨĪĬĮİǏỈỊ',
    'i'  => 'ìíîï',
    'J'  => 'Ĵ',
    'j'  => 'ĵ',
    'K'  => 'Ķ',
    'k'  => 'ķ',
    'L'  => 'ĹĻĽĿŁ',
    'l'  => 'ĺļľŀł',
    'N'  => 'ÑŃŅŇ',
    'n'  => 'ñńņňŉ',
    'O'  => 'ÒÓÔÕÖØŌŎŐƠǑǾỌỎỐỒỔỖỘỚỜỞỠỢ',
    'o'  => 'òóôõöøōŏőơǒǿọỏốồổỗộớờởỡợð',
    'R'  => 'ŔŖŘ',
    'r'  => 'ŕŗř',
    'S'  => 'ŚŜŞŠ',
    's'  => 'śŝşš',
    'T'  => 'ŢŤŦ',
    't'  => 'ţťŧ',
    'U'  => 'ÙÚÛÜŨŪŬŮŰŲƯǓǕǗǙǛỤỦỨỪỬỮỰ',
    'u'  => 'ùúûüũūŭůűųưǔǖǘǚǜụủứừửữự',
    'W'  => 'ŴẀẂẄ',
    'w'  => 'ŵẁẃẅ',
    'Y'  => 'ÝŶŸỲỸỶỴ',
    'y'  => 'ýÿŷỹỵỷỳ',
    'Z'  => 'ŹŻŽ',
    'z'  => 'źżž',
    # Ligatures
    'AE' => 'Æ',
    'ae' => 'æ',
    'OE' => 'Œ',
    'oe' => 'œ'
  }.freeze

  def unaccent
    str = clone
    UNACCENT_HASH.each do |k, v|
      str.gsub!(/[#{v}]/, k)
    end
    str
  end
end
